PART 1: PHPMyAdmin
You will complete questions 1-9 below in the PHPMyAdmin interface. 

The data you need is in the "country_club" database. This database
contains 3 tables:
    i) the "Bookings" table,
    ii) the "Facilities" table, and
    iii) the "Members" table.

In [1]:
import pandas as pd
import numpy as np
import sqlite3 as sql

In [2]:
con = sql.connect('sqlite_db_pythonsqlite.db')

In [3]:
#Q1: Some of the facilities charge a fee to members, but some do not.
#Write a SQL query to produce a list of the names of the facilities that do.


query = '''
SELECT name
FROM Facilities 
WHERE membercost != 0;
'''
df1 = pd.read_sql_query(query, con)
df1

             name
0  Tennis Court 1
1  Tennis Court 2
2  Massage Room 1
3  Massage Room 2
4    Squash Court

In [8]:
#Q2: How many facilities do not charge a fee to members? */

query = '''
SELECT COUNT(name) AS FacWithFreeMembership FROM Facilities
WHERE membercost = 0;
'''

df2 = pd.read_sql_query(query, con)
df2

   FacWithFreeMembership
0                      4

In [10]:
#Q3: Write an SQL query to show a list of facilities that charge a fee to members,
#where the fee is less than 20% of the facility's monthly maintenance cost.
#Return the facid, facility name, member cost, and monthly maintenance of the
#facilities in question. 

query = '''
SELECT facid, name AS facility_name, membercost, monthlymaintenance
FROM Facilities
WHERE membercost < 0.8 * monthlymaintenance AND
membercost != 0
'''

df3 = pd.read_sql_query(query, con)
df3

   facid   facility_name  membercost  monthlymaintenance
0      0  Tennis Court 1         5.0                 200
1      1  Tennis Court 2         5.0                 200
2      4  Massage Room 1         9.9                3000
3      5  Massage Room 2         9.9                3000
4      6    Squash Court         3.5                  80

In [11]:
#Q4: Write an SQL query to retrieve the details of facilities with ID 1 and 5.
#Try writing the query without using the OR operator.

query = '''
SELECT *
FROM Facilities
WHERE facid in (1,5)
'''

df4 = pd.read_sql_query(query, con)
df4

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,1,Tennis Court 2,5.0,25,8000,200
1,5,Massage Room 2,9.9,80,4000,3000

In [15]:
#Q5: Produce a list of facilities, with each labelled as
#'cheap' or 'expensive', depending on if their monthly maintenance cost is
#more than $100. Return the name and monthly maintenance of the facilities
#in question.

query = '''

SELECT name as facility, monthlymaintenance,
CASE
    WHEN monthlymaintenance > 100 THEN 'expensive'
    else 'cheap'
    END AS label
FROM Facilities
'''

df5 = pd.read_sql_query(query, con)
df5

          facility  monthlymaintenance      label
0   Tennis Court 1                 200  expensive
1   Tennis Court 2                 200  expensive
2  Badminton Court                  50      cheap
3     Table Tennis                  10      cheap
4   Massage Room 1                3000  expensive
5   Massage Room 2                3000  expensive
6     Squash Court                  80      cheap
7    Snooker Table                  15      cheap
8       Pool Table                  15      cheap

Q6: You'd like to get the first and last name of the last member(s)
who signed up. Try not to use the LIMIT clause for your solution.

In [20]:
query = '''

SELECT firstname, surname AS lastname
FROM Members
WHERE joindate in ((SELECT MAX(joindate) from Members),(SELECT min(joindate) from Members))
'''

df6 = pd.read_sql_query(query, con)
df6

  firstname lastname
0     GUEST    GUEST
1    Darren    Smith

Q7: Produce a list of all members who have used a tennis court.
Include in your output the name of the court, and the name of the member
formatted as a single column. Ensure no duplicate data, and order by
the member name.

In [32]:
query = '''

SELECT DISTINCT firstname ||' ' ||surname AS guest, f.name
FROM Members as m
inner join Bookings as b
ON m.memid = b.memid
inner join Facilities as f
ON b.facid = f.facid
WHERE f.facid in (0,1)
ORDER BY guest
'''

df7 = pd.read_sql_query(query, con)
df7

                guest            name
0          Anne Baker  Tennis Court 1
1          Anne Baker  Tennis Court 2
2        Burton Tracy  Tennis Court 2
3        Burton Tracy  Tennis Court 1
4        Charles Owen  Tennis Court 1
5        Charles Owen  Tennis Court 2
6        Darren Smith  Tennis Court 2
7       David Farrell  Tennis Court 1
8       David Farrell  Tennis Court 2
9         David Jones  Tennis Court 2
10        David Jones  Tennis Court 1
11       David Pinker  Tennis Court 1
12      Douglas Jones  Tennis Court 1
13      Erica Crumpet  Tennis Court 1
14     Florence Bader  Tennis Court 2
15     Florence Bader  Tennis Court 1
16        GUEST GUEST  Tennis Court 2
17        GUEST GUEST  Tennis Court 1
18     Gerald Butters  Tennis Court 1
19     Gerald Butters  Tennis Court 2
20   Henrietta Rumney  Tennis Court 2
21         Jack Smith  Tennis Court 1
22         Jack Smith  Tennis Court 2
23    Janice Joplette  Tennis Court 1
24    Janice Joplette  Tennis Court 2
25     Jemima Farrell  Tennis Court 2
26     Jemima Farrell  Tennis Court 1
27        Joan Coplin  Tennis Court 1
28          John Hunt  Tennis Court 1
29          John Hunt  Tennis Court 2
30    Matthew Genting  Tennis Court 1
31  Millicent Purview  Tennis Court 2
32         Nancy Dare  Tennis Court 2
33         Nancy Dare  Tennis Court 1
34    Ponder Stibbons  Tennis Court 2
35    Ponder Stibbons  Tennis Court 1
36   Ramnaresh Sarwin  Tennis Court 2
37   Ramnaresh Sarwin  Tennis Court 1
38         Tim Boothe  Tennis Court 2
39         Tim Boothe  Tennis Court 1
40         Tim Rownam  Tennis Court 2
41         Tim Rownam  Tennis Court 1
42      Timothy Baker  Tennis Court 2
43      Timothy Baker  Tennis Court 1
44        Tracy Smith  Tennis Court 1
45        Tracy Smith  Tennis Court 2

/* Q8: Produce a list of bookings on the day of 2012-09-14 which
will cost the member (or guest) more than $30. Remember that guests have
different costs to members (the listed costs are per half-hour 'slot'), and
the guest user's ID is always 0. Include in your output the name of the
facility, the name of the member formatted as a single column, and the cost.
Order by descending cost, and do not use any subqueries. */